nginx_benchmark/test/withKubearmor4_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 20.102.0.96 (be patient).....done


Server Software:        
Server Hostname:        20.102.0.96
Server Port:            80

Document Path:          /hello-world-one
Document Length:        146 bytes

Concurrency Level:      100
Time taken for tests:   3.140 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      27400 bytes
HTML transferred:       14600 bytes
Requests per second:    31.85 [#/sec] (mean)
Time per request:       3139.803 [ms] (mean)
Time per request:       31.398 [ms] (mean, across all concurrent requests)
Transfer rate:          8.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      232  281  30.4    282     404
Processing:   364  965 457.5    960    2009
Waiting:      364  965 457.6    960    2009
Total:        613 1245 474.9   1234    2325

Percentage of the requests served within a certain time (ms)
  50%   1234
  66%   1259
  75%   1264
  80%   1286
  90%   2267
  95%   2271
  98%   2291
  99%   2325
 100%   2325 (longest request)