nginx_benchmark/test/withKubearmor8_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 20.102.0.96 (be patient).....done


Server Software:        
Server Hostname:        20.102.0.96
Server Port:            80

Document Path:          /hello-world-one
Document Length:        146 bytes

Concurrency Level:      100
Time taken for tests:   3.381 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      27400 bytes
HTML transferred:       14600 bytes
Requests per second:    29.58 [#/sec] (mean)
Time per request:       3380.837 [ms] (mean)
Time per request:       33.808 [ms] (mean, across all concurrent requests)
Transfer rate:          7.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      238  355  74.2    411     412
Processing:   234  504 542.9    276    1825
Waiting:      234  504 542.9    275    1825
Total:        551  859 507.0    679    2092

Percentage of the requests served within a certain time (ms)
  50%    679
  66%    680
  75%    688
  80%    688
  90%   2059
  95%   2063
  98%   2092
  99%   2092
 100%   2092 (longest request)