nginx_benchmark/test/withPolicy4_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 20.102.0.96 (be patient).....done


Server Software:        
Server Hostname:        20.102.0.96
Server Port:            80

Document Path:          /hello-world-one
Document Length:        146 bytes

Concurrency Level:      100
Time taken for tests:   4.184 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      27400 bytes
HTML transferred:       14600 bytes
Requests per second:    23.90 [#/sec] (mean)
Time per request:       4184.453 [ms] (mean)
Time per request:       41.845 [ms] (mean, across all concurrent requests)
Transfer rate:          6.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      232  445 314.6    383    1374
Processing:   229 1180 944.0    409    2264
Waiting:      229 1180 944.1    409    2264
Total:        467 1625 930.7   1623    2646

Percentage of the requests served within a certain time (ms)
  50%   1623
  66%   2615
  75%   2616
  80%   2616
  90%   2617
  95%   2619
  98%   2625
  99%   2646
 100%   2646 (longest request)